app/controllers/admin/users_controller.rb

UPDATE "users" SET "role" = 0, "updated_at" = '2026-09-24 08:50:18.389155' WHERE "users"."id" = 2
---
  def update
    authorize @user, :update?

    if @user.update(user_params)

UPDATE "users" SET "locked" = FALSE, "updated_at" = '2026-09-24 07:43:17.204244' WHERE "users"."id" = 2
---
  def promote
    authorize @user, :promote?
    @user.paper_trail_event = "promoted"
    @user.update!(role: :moderator)

UPDATE "users" SET "role" = 0, "updated_at" = '2026-09-24 08:50:18.389155' WHERE "users"."id" = 2
---
  def demote
    authorize @user, :demote?
    @user.paper_trail_event = "demoted"
    @user.update!(role: :user)

UPDATE "users" SET "locked" = TRUE, "updated_at" = '2026-09-24 07:42:21.244639' WHERE "users"."id" = 2
---
  def lock
    authorize @user, :lock?
    @user.update!(locked: true)

UPDATE "users" SET "locked" = FALSE, "updated_at" = '2026-09-24 07:43:17.204244' WHERE "users"."id" = 2
---
  def unlock
    authorize @user, :unlock?
    @user.update!(locked: false)

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def set_user
    @user = User.find(params[:id])