app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
  def set_user
    @user = User.find(params[:id])