app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    authorize User
    @users = User.order(:name)

UPDATE "users" SET "email" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "[FILTERED]"], ["name", "Updated User"], ["updated_at", "2026-09-24 09:13:47.713725"], ["id", 980190964]]
---
  def update
    authorize @user, :update?

    if @user.update(user_params)

UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", "2026-09-24 06:42:25.930634"], ["id", 980190964]]
---
  def promote
    authorize @user, :promote?
    @user.paper_trail_event = "promoted"
    @user.update!(role: :moderator)

UPDATE "users" SET "locked" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["locked", 1], ["updated_at", "2026-09-24 06:42:25.982549"], ["id", 980190964]]
---
  def lock
    authorize @user, :lock?
    @user.update!(locked: true)