app/controllers/moderation/dashboards_controller.rb

  def show
    authorize current_user, :moderate?
    @recent_activity = PaperTrail::Version
      .includes(:item)
      .order(created_at: :desc)
      .limit(20)
    activity_user_ids = @recent_activity.filter_map(&:whodunnit)
    @activity_users = User.where(id: activity_user_ids).index_by { |user| user.id.to_s }
    @users = User.order(:name)
    @pending_places = Place.where(approved: false).includes(:proposed_by).order(created_at: :desc)
    @pending_status_reports = StatusReport.where(reviewed: false).includes(:place, :user).order(created_at: :desc)
---
SELECT "versions".* FROM "versions" ORDER BY "versions"."created_at" DESC LIMIT 20
SELECT "users".* FROM "users" WHERE "users"."id" = 1
SELECT "places".* FROM "places" WHERE "places"."id" IN (2, 1)
SELECT "status_reports".* FROM "status_reports" WHERE "status_reports"."reviewed" = FALSE ORDER BY "status_reports"."created_at" DESC