app/controllers/moderation/places_controller.rb

  def edit
    authorize @place, :update?
    if @place.locked_by_id.blank? || @place.locked_by_id == current_user.id
      @place.update!(locked_by: current_user, locked_at: Time.current)
---
UPDATE "places" SET "locked_by_id" = ?, "locked_at" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["locked_by_id", 980190963], ["locked_at", "2026-09-24 09:15:26.889526"], ["updated_at", "2026-09-24 09:15:26.889705"], ["id", 980190963]]
UPDATE "users" SET "confirmation_token" = ?, "unconfirmed_email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["confirmation_token", "[FILTERED]"], ["unconfirmed_email", "[FILTERED]"], ["updated_at", "2026-09-24 09:14:38.039793"], ["id", 980190963]]

  def update
    authorize @place, :update?
    if @place.update(place_params)
---
UPDATE "places" SET "locked_at" = ?, "locked_by_id" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["locked_at", nil], ["locked_by_id", nil], ["updated_at", "2026-09-24 11:11:24.005420"], ["id", 980190963]]

  def approve
    authorize @place, :approve?
    @place.update!(approved: true)
---
UPDATE "places" SET "approved" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["approved", 1], ["updated_at", "2026-09-24 06:26:53.932879"], ["id", 980190963]]

  def reject
    authorize @place, :reject?
    @place.update!(approved: false)
---
UPDATE "places" SET "opening_hours" = ?, "status" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["opening_hours", "Weekdays, 08:00-16:00"], ["status", 3], ["updated_at", "2026-09-24 09:15:59.710506"], ["id", 980190963]]

  def set_place
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" IN (?, ?)  [["id", 298486374], ["id", 980190962]]