app/controllers/moderation/places_controller.rb

  def edit
    authorize @place, :update?
    if @place.locked_by_id.blank? || @place.locked_by_id == current_user.id
      @place.update!(locked_by: current_user, locked_at: Time.current)
---
UPDATE "places" SET "locked_by_id" = 9, "locked_at" = '2026-09-24 11:10:38.010082', "updated_at" = '2026-09-24 11:10:38.010911' WHERE "places"."id" = 7

  def update
    authorize @place, :update?
    if @place.update(place_params)
      @place.update!(locked_by: nil, locked_at: nil)
---
UPDATE "places" SET "locked_by_id" = NULL, "locked_at" = NULL, "updated_at" = '2026-09-24 11:16:04.041535' WHERE "places"."id" = 7

  def approve
    authorize @place, :approve?
    @place.update!(approved: true)
---
UPDATE "places" SET "approved" = TRUE, "updated_at" = '2026-09-24 09:07:33.660115' WHERE "places"."id" = 4

  def reject
    authorize @place, :reject?
    @place.update!(approved: false)
---
UPDATE "places" SET "locked_by_id" = NULL, "locked_at" = NULL, "updated_at" = '2026-09-24 08:43:35.653798' WHERE "places"."id" = 3

  def unlock
    authorize @place, :unlock?
    @place.update!(locked_by: nil, locked_at: nil)
---
UPDATE "places" SET "locked_by_id" = NULL, "locked_at" = NULL, "updated_at" = '2026-09-24 11:13:15.004656' WHERE "places"."id" = 7

  def set_place
    @place = Place.find(params[:id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = 4 LIMIT 1