app/controllers/moderation/status_reports_controller.rb

  def update
    set_status_report
    authorize @status_report, :update?

    if @status_report.update(status_report_params)
---
UPDATE "status_reports" SET "reported_opening_hours" = ?, "reported_status" = ?, "updated_at" = ? WHERE "status_reports"."id" = ?  [["reported_opening_hours", "Daily, 10:00-18:00"], ["reported_status", 1], ["updated_at", "2026-09-24 08:37:54.174444"], ["id", 980190963]]

  def approve
    set_status_report
    authorize @status_report, :approve?
    @status_report.update!(reviewed: true)

    place_updates = { status: @status_report.reported_status }
    if @status_report.reported_opening_hours.present?
      place_updates[:opening_hours] = @status_report.reported_opening_hours
    end
    @status_report.place.update!(place_updates)
---
UPDATE "status_reports" SET "reviewed" = ?, "updated_at" = ? WHERE "status_reports"."id" = ?  [["reviewed", 1], ["updated_at", "2026-09-24 06:17:03.843219"], ["id", 980190963]]
UPDATE "places" SET "opening_hours" = ?, "status" = ?, "updated_at" = ? WHERE "places"."id" = ?  [["opening_hours", "Weekdays, 08:00-16:00"], ["status", 3], ["updated_at", "2026-09-24 08:37:54.143160"], ["id", 980190963]]

  def reject
    set_status_report
    authorize @status_report, :reject?
    @status_report.update!(reviewed: true)
---
UPDATE "status_reports" SET "reported_opening_hours" = ?, "reported_status" = ?, "updated_at" = ? WHERE "status_reports"."id" = ?  [["reported_opening_hours", "Daily, 10:00-18:00"], ["reported_status", 1], ["updated_at", "2026-09-24 09:13:52.706794"], ["id", 980190963]]

  def set_status_report
    @status_report = StatusReport.find(params[:id])
---
SELECT "status_reports".* FROM "status_reports" WHERE "status_reports"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]