app/controllers/moderation/status_reports_controller.rb

  def approve
    set_status_report
    authorize @status_report, :approve?
    @status_report.update!(reviewed: true)

    place_updates = { status: @status_report.reported_status }
    if @status_report.reported_opening_hours.present?
      place_updates[:opening_hours] = @status_report.reported_opening_hours
    end
    @status_report.place.update!(place_updates)
---
UPDATE "status_reports" SET "reviewed" = TRUE, "updated_at" = '2026-09-24 08:35:51.191759' WHERE "status_reports"."id" = 1
UPDATE "places" SET "opening_hours" = '10:00 - 12:00', "status" = 2, "updated_at" = '2026-09-24 08:44:14.827707' WHERE "places"."id" = 3

  def set_status_report
    @status_report = StatusReport.find(params[:id])
---
SELECT "status_reports".* FROM "status_reports" WHERE "status_reports"."id" = 2 LIMIT 1