app/controllers/check_ins_controller.rb

SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def new
    @place = Place.find(params[:place_id])

SELECT "places".* FROM "places" WHERE "places"."id" IN (?, ?, ?)  [["id", 980190963], ["id", 298486374], ["id", 980190962]]
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = ? AND (ends_at > ?)  [["place_id", 980190962], [nil, "2026-09-21 13:41:38.884082"]]
INSERT INTO "check_ins" ("created_at", "ends_at", "place_id", "started_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "users" ("confirmation_token", "created_at", "email", "locked", "name", "password_digest", "role", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @place = Place.find(check_in_params[:place_id])
    @active_check_ins = @place.check_ins.active.count
    @active_check_in_holds = @place.check_in_holds.active.count
    @check_in = CheckIn.new(place: @place, user: current_user)
    @check_in_hold = @place.check_in_holds.find_by(user: current_user)
    authorize @check_in, :create?

    @check_in = CheckIn.create_with_capacity!(
      place: @place,
      user: current_user,
      expected_minutes: check_in_params[:expected_minutes].to_i,
      hold: @place.check_in_holds.find_by(user: current_user)
    )

SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."user_id" = ? AND "check_ins"."id" = ? LIMIT ?  [["user_id", 980190963], ["id", 980190963], ["LIMIT", 1]]
---
  def show
    @check_in = current_user.check_ins.find(params[:id])