app/controllers/check_ins_controller.rb

SELECT "places".* FROM "places" WHERE "places"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 12 AND (ends_at > '2026-09-24 12:53:50.517002')
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 12 AND (expires_at > '2026-09-24 12:53:50.518117')
---
  def new
    @place = Place.find(params[:place_id])
    @active_check_ins = @place.check_ins.active.count
    @active_check_in_holds = @place.check_in_holds.active.count

SELECT "places".* FROM "places" WHERE "places"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-25 06:38:32.072825')
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 1 AND (expires_at > '2026-09-25 06:38:32.077575')
SELECT "check_in_holds".* FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 1 AND "check_in_holds"."user_id" = 1 LIMIT 1
INSERT INTO "check_ins" ("place_id", "user_id", "started_at", "ends_at", "created_at", "updated_at") VALUES (1, 2, '2026-09-21 13:44:06.621884', '2026-09-21 14:14:06.621884', '2026-09-21 13:44:06.623203', '2026-09-21 13:44:06.623203') RETURNING "id"
SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."user_id" = 9 AND "check_ins"."id" = 7 LIMIT 1
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 1 AND (expires_at > '2026-09-25 06:38:32.092780') AND "check_in_holds"."user_id" != 1
---
  def create
    @place = Place.find(check_in_params[:place_id])
    @active_check_ins = @place.check_ins.active.count
    @active_check_in_holds = @place.check_in_holds.active.count
    @check_in = CheckIn.new(place: @place, user: current_user)
    @check_in_hold = @place.check_in_holds.find_by(user: current_user)
    authorize @check_in, :create?

    @check_in = CheckIn.create_with_capacity!(
      place: @place,
      user: current_user,
      expected_minutes: check_in_params[:expected_minutes].to_i,
      hold: @place.check_in_holds.find_by(user: current_user)
    )

    redirect_to @check_in
  rescue CheckIn::CapacityExceeded, CheckIn::AlreadyCheckedIn => error
    @active_check_ins = @place.check_ins.active.count

SELECT "check_ins".* FROM "check_ins" WHERE "check_ins"."user_id" = 1 AND "check_ins"."id" = 1 LIMIT 1
---
  def show
    @check_in = current_user.check_ins.find(params[:id])

SELECT "places".* FROM "places" WHERE "places"."id" = 12 LIMIT 1
DELETE FROM "check_in_holds" WHERE "check_in_holds"."id" = 1
SELECT "check_in_holds".* FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 12 AND "check_in_holds"."user_id" = 11 LIMIT 1
---
  def cancel_hold
    place = Place.find(params[:place_id])
    place.check_in_holds.find_by(user: current_user)&.destroy!