app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."approved" = TRUE ORDER BY "places"."name" ASC
SELECT COUNT(*) AS "count_all", "check_ins"."place_id" AS "check_ins_place_id" FROM "check_ins" WHERE (ends_at > '2026-09-24 12:54:15.479048') AND "check_ins"."place_id" IN (SELECT "places"."id" FROM "places" WHERE "places"."approved" = TRUE ORDER BY "places"."name" ASC) GROUP BY "check_ins"."place_id"
---
  def index
    @search = params[:search].to_s.strip
    @category = params[:category].presence_in(Place.categories.keys)
    @status = params[:status].presence_in(Place.statuses.keys)

    @places = Place.where(approved: true)
    @places = @places.where(category: @category) if @category
    @places = @places.where(status: @status) if @status
    if @search.present?
      escaped_search = Place.sanitize_sql_like(@search.downcase)
      @places = @places.where("LOWER(name) LIKE ?", "%#{escaped_search}%")
    end
    @places = @places.order(:name)
    @active_check_ins_by_place = CheckIn.active.where(place_id: @places).group(:place_id).count

SELECT "places".* FROM "places" WHERE "places"."id" = 12 LIMIT 1
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 12 AND (ends_at > '2026-09-24 12:53:48.345767')
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 12 AND (expires_at > '2026-09-24 12:53:48.346573')
---
  def show
    @place = Place.find(params[:id])
    @active_check_ins = @place.check_ins.active.count
    @active_check_in_holds = @place.check_in_holds.active.count

SELECT "places".* FROM "places" WHERE "places"."id" = 12 LIMIT 1
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 12 AND (expires_at > '2026-09-24 12:53:47.246383')
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 12 AND (ends_at > '2026-09-24 12:53:47.245675')
---
  def availability
    place = Place.find(params[:id])
    render json: {
      active_count: place.check_ins.active.count,
      held_count: place.check_in_holds.active.count,
      total_count: place.check_ins.active.count + place.check_in_holds.active.count,
      capacity: place.capacity

INSERT INTO "places" ("name", "category", "latitude", "longitude", "capacity", "opening_hours", "status", "approved", "proposed_by_id", "locked_by_id", "locked_at", "created_at", "updated_at") VALUES ('River Shade', 2, 47.34343, 6.3434, 2, '8:00 - 18:00', 0, FALSE, 4, NULL, NULL, '2026-09-24 07:30:58.668228', '2026-09-24 07:30:58.668228') RETURNING "id"
---
  def create
    @place = current_user.proposed_places.build(place_params)
    authorize @place, :create?

    if @place.save