app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."approved" = ? ORDER BY "places"."created_at" DESC  [["approved", 0]]
SELECT "places".* FROM "places" WHERE "places"."approved" = ? ORDER BY "places"."name" ASC  [["approved", 1]]
SELECT COUNT(*) AS "count_all", "check_ins"."place_id" AS "check_ins_place_id" FROM "check_ins" WHERE (ends_at > ?) AND "check_ins"."place_id" IN (SELECT "places"."id" FROM "places" WHERE "places"."approved" = ? ORDER BY "places"."name" ASC) GROUP BY "check_ins"."place_id"  [[nil, "2026-09-24 08:43:04.811454"], ["approved", 1]]
---
  def index
    @search = params[:search].to_s.strip
    @category = params[:category].presence_in(Place.categories.keys)
    @status = params[:status].presence_in(Place.statuses.keys)

    @places = Place.where(approved: true)
    @places = @places.where(category: @category) if @category
    @places = @places.where(status: @status) if @status
    if @search.present?
      escaped_search = Place.sanitize_sql_like(@search.downcase)
      @places = @places.where("LOWER(name) LIKE ?", "%#{escaped_search}%")
    end
    @places = @places.order(:name)
    @active_check_ins_by_place = CheckIn.active.where(place_id: @places).group(:place_id).count

INSERT INTO "places" ("approved", "capacity", "category", "created_at", "latitude", "locked_at", "locked_by_id", "longitude", "name", "opening_hours", "proposed_by_id", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "users" ("confirmation_token", "created_at", "email", "locked", "name", "password_digest", "role", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @place = current_user.proposed_places.build(place_params)
    authorize @place, :create?

    if @place.save