app/controllers/places_controller.rb

  def create
    @place = current_user.proposed_places.build(place_params)

    if @place.save
---
INSERT INTO "places" ("name", "category", "latitude", "longitude", "capacity", "opening_hours", "status", "approved", "proposed_by_id", "locked_by_id", "locked_at", "created_at", "updated_at") VALUES ('River Shade', 2, 47.34343, 6.3434, 2, '8:00 - 18:00', 0, FALSE, 4, NULL, NULL, '2026-09-24 07:30:58.668228', '2026-09-24 07:30:58.668228') RETURNING "id"