app/controllers/profile_controller.rb

  def update
    @user = current_user
    authorize @user, :update?, policy_class: ProfilePolicy

    if params.dig(:user, :name).present?
      @user.name = params[:user][:name]
    end

    if params.dig(:user, :email).present?
      if !@user.authenticate(params.dig(:user, :current_password).to_s)
        @user.errors.add(:current_password, "is invalid")
        return render :edit, status: :unprocessable_entity
      end

      @user.unconfirmed_email = params[:user][:email]
      @user.confirmation_token = SecureRandom.hex(16)
      Rails.logger.debug(
        "Confirm email: http://localhost:3000/profile/confirm_email/#{@user.confirmation_token}"
      )
    end

    if params.dig(:user, :password).present?
      if !@user.authenticate(params.dig(:user, :current_password).to_s)
        @user.errors.add(:current_password, "is invalid")
        return render :edit, status: :unprocessable_entity
      end

      @user.password = params[:user][:password]
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "[FILTERED]"], ["id", 980190963], ["LIMIT", 1]]
INSERT INTO "users" ("confirmation_token", "created_at", "email", "locked", "name", "password_digest", "role", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
UPDATE "users" SET "confirmation_token" = ?, "email" = ?, "unconfirmed_email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["confirmation_token", "[FILTERED]"], ["email", "[FILTERED]"], ["unconfirmed_email", "[FILTERED]"], ["updated_at", "2026-09-24 09:25:10.383273"], ["id", 980190963]]

  def confirm_email
    @user = User.find_by(confirmation_token: params[:token])
    return redirect_to profile_path, alert: "Invalid confirmation token." if @user.nil?
    authorize @user, :confirm_email?, policy_class: ProfilePolicy

    @user.email = @user.unconfirmed_email
    @user.unconfirmed_email = nil
    @user.confirmation_token = nil

    @user.save!
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = ? LIMIT ?  [["confirmation_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "confirmation_token" = ?, "email" = ?, "unconfirmed_email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["confirmation_token", "[FILTERED]"], ["email", "[FILTERED]"], ["unconfirmed_email", "[FILTERED]"], ["updated_at", "2026-09-24 06:56:00.925950"], ["id", 980190963]]