app/controllers/profile_controller.rb

  def update
    @user = current_user
    authorize @user, :update?, policy_class: ProfilePolicy

    if params.dig(:user, :name).present?
      @user.name = params[:user][:name]
    end

    if params.dig(:user, :email).present?
      if !@user.authenticate(params.dig(:user, :current_password).to_s)
        @user.errors.add(:current_password, "is invalid")
        return render :edit, status: :unprocessable_entity
      end

      @user.unconfirmed_email = params[:user][:email]
      @user.confirmation_token = SecureRandom.hex(16)
      Rails.logger.debug(
        "Confirm email: http://localhost:3000/profile/confirm_email/#{@user.confirmation_token}"
      )
    end

    if params.dig(:user, :password).present?
      if !@user.authenticate(params.dig(:user, :current_password).to_s)
        @user.errors.add(:current_password, "is invalid")
        return render :edit, status: :unprocessable_entity
      end

      @user.password = params[:user][:password]
    end

    if @user.save
---
UPDATE "users" SET "password_digest" = '$2a$12$QAr8UVKoNGgVNABvJpzwXOHObOXOLcf.0LqAozumD.fuS7FSKORjK', "unconfirmed_email" = 'admin@relaxspot.localy', "confirmation_token" = '73576b56de0ab41ef0bf73d7515dc5a7', "updated_at" = '2026-09-24 07:00:06.267522' WHERE "users"."id" = 4

  def confirm_email
    @user = User.find_by(confirmation_token: params[:token])
    return redirect_to profile_path, alert: "Invalid confirmation token." if @user.nil?
    authorize @user, :confirm_email?, policy_class: ProfilePolicy

    @user.email = @user.unconfirmed_email
    @user.unconfirmed_email = nil
    @user.confirmation_token = nil

    @user.save!
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = '73576b56de0ab41ef0bf73d7515dc5a7' LIMIT 1
UPDATE "users" SET "email" = 'user.three.test@relaxspot.local', "unconfirmed_email" = NULL, "confirmation_token" = NULL, "updated_at" = '2026-09-24 09:40:23.038446' WHERE "users"."id" = 13