app/controllers/status_reports_controller.rb

  def new
    @place = Place.find(params[:place_id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = 2 LIMIT 1

  def create
    @place = Place.find(params[:place_id])
    @status_report = @place.status_reports.build(status_report_params)
    @status_report.user = current_user

    if @status_report.save
---
SELECT "places".* FROM "places" WHERE "places"."id" = 2 LIMIT 1
INSERT INTO "status_reports" ("place_id", "user_id", "reported_status", "reviewed", "created_at", "updated_at", "reported_opening_hours") VALUES (3, 4, 1, FALSE, '2026-09-24 08:44:05.596690', '2026-09-24 08:44:05.596690', '10:00 - 12:00') RETURNING "id"