app/controllers/status_reports_controller.rb

  def new
    @place = Place.find(params[:place_id])
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]

  def create
    @place = Place.find(params[:place_id])
    @status_report = @place.status_reports.build(status_report_params)
    @status_report.user = current_user

    if @status_report.save
---
SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
INSERT INTO "status_reports" ("created_at", "place_id", "reported_status", "reviewed", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-09-24 06:15:54.561397"], ["place_id", 980190963], ["reported_status", 2], ["reviewed", 0], ["updated_at", "2026-09-24 06:15:54.561397"], ["user_id", 980190963]]
INSERT INTO "users" ("confirmation_token", "created_at", "email", "locked", "name", "password_digest", "role", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"