app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
      PaperTrail::Version.where(item: @user).order(:created_at).last&.update!(whodunnit: @user.id.to_s)
---
INSERT INTO "users" ("confirmation_token", "created_at", "email", "locked", "name", "password_digest", "role", "unconfirmed_email", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
UPDATE "users" SET "confirmation_token" = ?, "unconfirmed_email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["confirmation_token", "[FILTERED]"], ["unconfirmed_email", "[FILTERED]"], ["updated_at", "2026-09-24 09:16:53.453172"], ["id", 980190963]]