app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "role", "locked", "unconfirmed_email", "confirmation_token", "created_at", "updated_at") VALUES ('yoshi gyger', 'test@email.com', '$2a$12$kAE.ZQvU9ecO6dq49k1HTOQSHLlXl9h41gDrUbNDOx1dSA6OuSFgS', 0, FALSE, NULL, NULL, '2026-09-21 13:32:56.398908', '2026-09-21 13:32:56.398908') RETURNING "id"