app/models/check_in_hold.rb

SELECT "places".* FROM "places" WHERE "places"."id" = 12 LIMIT 1
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 12 AND (expires_at > '2026-09-24 12:53:50.525854') AND "check_in_holds"."user_id" != 11
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 12 AND (ends_at > '2026-09-24 12:53:50.525112')
INSERT INTO "check_in_holds" ("expires_at", "place_id", "user_id", "created_at", "updated_at") VALUES ('2026-09-24 12:55:50.524906', 12, 11, '2026-09-24 12:53:50.526620', '2026-09-24 12:53:50.526620') RETURNING "id"
---
  def self.claim!(place:, user:)
    transaction do
      locked_place = Place.lock.find(place.id)
      hold = find_or_initialize_by(place: locked_place, user: user)
      hold.expires_at = HOLD_DURATION.from_now

      available = locked_place.check_ins.active.count + locked_place.check_in_holds.active.where.not(user_id: user.id).count
      raise CapacityExceeded, "Place is currently full" if available >= locked_place.capacity

      hold.save!