app/models/check_in.rb

  def self.create_with_capacity!(place:, user:, expected_minutes:, hold: nil)
    transaction do
      locked_place = Place.lock.find(place.id)
      hold ||= locked_place.check_in_holds.find_by(user_id: user.id)

      active_holds = locked_place.check_in_holds.active.where.not(user_id: user.id).count
      if locked_place.check_ins.active.count + active_holds >= locked_place.capacity
        raise CapacityExceeded, "Place is currently full"
      end

      if locked_place.check_ins.active.where(user_id: user.id).exists?
---
INSERT INTO "check_ins" ("place_id", "user_id", "started_at", "ends_at", "created_at", "updated_at") VALUES (1, 2, '2026-09-21 13:44:06.621884', '2026-09-21 14:14:06.621884', '2026-09-21 13:44:06.623203', '2026-09-21 13:44:06.623203') RETURNING "id"
SELECT "places".* FROM "places" WHERE "places"."id" = 1 LIMIT 1
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-24 06:31:16.318815')
SELECT COUNT(*) FROM "check_in_holds" WHERE "check_in_holds"."place_id" = 1 AND (expires_at > '2026-09-25 06:38:32.092780') AND "check_in_holds"."user_id" != 1
SELECT COUNT(*) FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-25 06:38:32.096002')
SELECT 1 AS one FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-25 06:38:32.098021') AND "check_ins"."user_id" = 1 LIMIT 1

  def user_has_no_active_check_in_at_place
    return if place.blank? || user.blank?

    if place.check_ins.active.where.not(id: id).where(user_id: user.id).exists?
---
SELECT 1 AS one FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-24 06:31:16.321291') AND "check_ins"."id" IS NOT NULL AND "check_ins"."user_id" = 4 LIMIT 1
SELECT 1 AS one FROM "check_ins" WHERE "check_ins"."place_id" = 1 AND (ends_at > '2026-09-25 06:38:32.100955') AND "check_ins"."id" IS NOT NULL AND "check_ins"."user_id" = 1 LIMIT 1