app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'user.three.test@relaxspot.local' AND "users"."id" != 13 LIMIT 1
---
  def unconfirmed_email_is_available
    return if unconfirmed_email.blank?
    return unless User.where(email: unconfirmed_email).where.not(id: id).exists?