app/views/moderation/dashboards/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 4
---
              <strong><%= status_report.place.name %></strong>
              <span><%= status_report.reported_status.humanize %><%= " · hours changed" if status_report.reported_opening_hours.present? %> · reported by <%= status_report.user.name %></span>